---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadTreadRiserProfile
source: html/66f1ebbe-f9e9-a24b-59ec-1061e0d1c532.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadTreadRiserProfile Property

Tread/Riser profile is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadTreadRiserProfile { get; }
```